#+TITLE: Etl_asn_metadata_table
Goal is to get ASN metadata from peeringdb
* Get company to asn list - delete heading below
Log into gcloud
#+BEGIN_SRC tmate :window prepare
gcloud auth login
#+END_SRC
Set the project
#+BEGIN_SRC tmate :window prepare
gcloud config set project k8s-infra-ii-sandbox
#+END_SRC
#+BEGIN_SRC shell :results silent
gsutil cp gs://ii_bq_scratch_dump/potaroo_company_asn.csv ~/potaroo_company_asn.csv
#+END_SRC
#+BEGIN_SRC shell :results silent
gsutil cp gs://ii_bq_scratch_dump/peeringdb_company_asn.csv gs://ii_bq_scratch_dump/potaroo_company_asn.csv
#+END_SRC
#+BEGIN_SRC shell
#gsutil ls gs://ii_bq_scratch_dump/
ls -al ~/potaroo_company_asn.csv
#+END_SRC

#+RESULTS:
#+begin_example
-rw-r--r-- 1 ii ii 6668250 Jun  8 05:38 /home/ii/potaroo_company_asn.csv
#+end_example

